app/controllers/receive_emails_controller.rb

SELECT "receive_emails".* FROM "receive_emails"
---
  def index
    @receive_emails = ReceiveEmail.all

INSERT INTO "receive_emails" ("name", "phone", "message", "vehicle", "price", "year", "link_vehicle", "brand_vehicle", "model_vehicle", "kilometer_vehicle", "accessories_vehicle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @receive_email = ReceiveEmail.new(receive_email_params)

    respond_to do |format|
      if @receive_email.save

DELETE FROM "receive_emails" WHERE "receive_emails"."id" = $1  [["id", 1]]
---
  def destroy
    @receive_email.destroy

SELECT  "receive_emails".* FROM "receive_emails" WHERE "receive_emails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_receive_email
      @receive_email = ReceiveEmail.find(params[:id])