app/controllers/receive_emails_controller.rb

  def create
    @receive_email = ReceiveEmail.new(receive_email_params)

    respond_to do |format|
      if @receive_email.save
---
INSERT INTO "receive_emails" ("name", "email", "phone", "message", "vehicle", "price", "year", "link_vehicle", "brand_vehicle", "model_vehicle", "kilometer_vehicle", "accessories_vehicle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def destroy
    @receive_email.destroy
---
DELETE FROM "receive_emails" WHERE "receive_emails"."id" = $1  [["id", 2]]

    def set_receive_email
      @receive_email = ReceiveEmail.find(params[:id])
---
SELECT  "receive_emails".* FROM "receive_emails" WHERE "receive_emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]