app/controllers/receive_emails_controller.rb

    def set_receive_email
      @receive_email = ReceiveEmail.find(params[:id])
---
SELECT  "receive_emails".* FROM "receive_emails" WHERE "receive_emails"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]